In [1]:
# Pandas Assignment

# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.

# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
#     Fill it with 5 sample student records and display the top 3 rows using head().

# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.

# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.

# 5. Introduce a missing value (NaN) in the "Science" column and then:
#     (a) Identify missing values using isnull()
#     (b) Replace the missing value with the column mean using fillna().

# 6. Filter and display all students whose "Average" score is greater than 75.

# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.

# 8. Group students based on their "English" score range (like above or below 70)
#     and find the mean of "Maths" and "Science" marks for each group.

# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score.

# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to define path)
#     and verify if the file is successfully created using os.path.exists().

In [2]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data,index=['a','b','c','d','e'])

print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
#     Fill it with 5 sample student records and display the top 3 rows using head().

data = {'student_name':['rishi','tanu','saniya','isha','meera'],
           'maths':[68,58,64,55,59],
           'science':[70,50,60,40,55],
           'english':[66,69,58,55,50]}

df=pd.DataFrame(data)
df.head(3)

  student_name  maths  science  english
0        rishi     68       70       66
1         tanu     58       50       69
2       saniya     64       60       58

In [4]:
# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.

data=pd.read_csv(r"C:\Users\rutuj\Downloads\data.csv")
data.shape
print(data)

   Name  Age    City
0  Isha   22    Pune
1  Amit   25  Mumbai
2  Neha   24   Delhi

In [5]:
# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.


data = {'student_name':['rishi','tanu','saniya','isha','meera'],
           'maths':[68,58,64,55,59],
           'science':[70,50,60,55,45],
           'english':[66,69,58,55,50]}

df=pd.DataFrame(data)

df['Total']=df['maths']+df['science']+df['english']

df['Average']=(df['Total']/3)

print(df.head())

  student_name  maths  science  english  Total    Average
0        rishi     68       70       66    204  68.000000
1         tanu     58       50       69    177  59.000000
2       saniya     64       60       58    182  60.666667
3         isha     55       55       55    165  55.000000
4        meera     59       45       50    154  51.333333

In [6]:
# 5. Introduce a missing value (NaN) in the "Science" column and then:
#     (a) Identify missing values using isnull()
import numpy as np
df.loc[2,'science']=None
print("with missing data values\n",df)
df['science'].isnull()

#     (b) Replace the missing value with the column mean using fillna().
mean=df['science'].mean()
df['science']=df['science'].fillna(df['science'].mean())

print("\n",df)

with missing data values
   student_name  maths  science  english  Total    Average
0        rishi     68     70.0       66    204  68.000000
1         tanu     58     50.0       69    177  59.000000
2       saniya     64      NaN       58    182  60.666667
3         isha     55     55.0       55    165  55.000000
4        meera     59     45.0       50    154  51.333333

   student_name  maths  science  english  Total    Average
0        rishi     68     70.0       66    204  68.000000
1         tanu     58     50.0       69    177  59.000000
2       saniya     64     55.0       58    182  60.666667
3         isha     55     55.0       55    165  55.000000
4        meera     59     45.0       50    154  51.333333

In [7]:
# 6. Filter and display all students whose "Average" score is greater than 60.

print(df[df['Average'] > 60])

  student_name  maths  science  english  Total    Average
0        rishi     68     70.0       66    204  68.000000
2       saniya     64     55.0       58    182  60.666667

In [8]:
# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performer

print(df.sort_values(by='Total',ascending=False))
df.head(3)

  student_name  maths  science  english  Total    Average
0        rishi     68     70.0       66    204  68.000000
2       saniya     64     55.0       58    182  60.666667
1         tanu     58     50.0       69    177  59.000000
3         isha     55     55.0       55    165  55.000000
4        meera     59     45.0       50    154  51.333333

  student_name  maths  science  english  Total    Average
0        rishi     68     70.0       66    204  68.000000
1         tanu     58     50.0       69    177  59.000000
2       saniya     64     55.0       58    182  60.666667

In [13]:
# 8. Group students based on their "English" score range (like above or below 70)

df['english_group']=np.where(df['english']>60,
                             'above 60',
                             'below 60')


#     and find the mean of "Maths" and "Science" marks for each group.

result= df.groupby('english_group')[['maths','science']].mean()
print(result)

                   maths    science
english_group
above 60       63.000000  60.000000
below 60       59.333333  51.666667

In [10]:
# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score.

In [21]:
df1 = pd.DataFrame({
    'student_name':['rishi','tanu','saniya','isha','meera'],
    'Total_marks':[204,177,182,165,154]
       })
df2 = pd.DataFrame({
    'student_name':['rishi','tanu','saniya','isha','meera'],
    'Sports_score':[10,6,8,7,9]
       })

merge_df=pd.merge(df1,df2,on='student_name')

merge_df['Overall_Score'] = merge_df['Total_marks'] + merge_df['Sports_score']
print(merge_df)

  student_name  Total_marks  Sports_score  Overall_Score
0        rishi          204            10            214
1         tanu          177             6            183
2       saniya          182             8            190
3         isha          165             7            172
4        meera          154             9            163

In [24]:
# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to 
# define path)
#     and verify if the file is successfully created using os.path.exists().
import os
user_name=os.getlogin()

export_path= r"C:\Users\rutuj\Documents\final_scores.csv"

merge_df.to_csv(export_path, index=False)
print(f"Data exported successfully to :{export_path}")

Data exported successfully to :C:\Users\rutuj\Documents\final_scores.csv